In [7]:
import pandas as pd

In [1]:
names = 'Name1 Surname1, Name2 Surname2, Name3 Surname3'

In [4]:
names_list = names.split(', ')

In [5]:
names_list

['Name1 Surname1', 'Name2 Surname2', 'Name3 Surname3']

In [38]:
df = pd.DataFrame({'client_id': [9002, 6722, 8799, 8737, 5208] \
                   , 'sex': [1, 1, 1, 0, 0] \
                   , 'wealth': ['medium', 'high', 'high', 'low', 'medium'] \
                   , 'age': [63, 54, 52, 54, 37]})

In [24]:
df[(df.wealth == 'medium')&(df.age > 35)]

   client_id  sex  wealth  age
0       9002    1  medium   63
4       5208    0  medium   37

In [25]:
medium_35 = df.query('wealth == "medium" and age > 35')

In [26]:
medium_35

   client_id  sex  wealth  age
0       9002    1  medium   63
4       5208    0  medium   37

In [ ]:
df = df.rename(columns= \
    {'Клиент id': 'client_id', \
     'Пол': 'sex', \
     'Благосостояние': 'wealth', \
     'Возраст': 'age'}

In [27]:
df = pd.DataFrame({'Клиент id': [9002, 6722, 8799, 8737, 5208] \
                   , 'Пол': [1, 1, 1, 0, 0] \
                   , 'Благосостояние': ['medium', 'high', 'high', 'low', 'medium'] \
                   , 'Возраст': [63, 54, 52, 54, 37]})

In [28]:
df

   Клиент id  Пол Благосостояние  Возраст
0       9002    1         medium       63
1       6722    1           high       54
2       8799    1           high       52
3       8737    0            low       54
4       5208    0         medium       37

In [29]:
renamelist = {'Клиент id': 'client_id', 'Пол': 'sex', 'Благосостояние': 'wealth', 'Возраст': 'age'}

In [30]:

df = df.rename(columns=renamelist)

In [31]:
df

   client_id  sex  wealth  age
0       9002    1  medium   63
1       6722    1    high   54
2       8799    1    high   52
3       8737    0     low   54
4       5208    0  medium   37

In [36]:
df['older_than_30'] = df.age > 30

In [55]:
df

   client_id  sex  wealth  age
0       9002    1  medium   63
1       6722    1    high   54
2       8799    1    high   52
3       8737    0     low   54
4       5208    0  medium   37

In [45]:
unique_num = df.nunique()

In [50]:
unique_num

client_id    5
sex          2
wealth       3
age          4
dtype: int64

In [51]:
data = pd.DataFrame({
    'client_id': [5392, 9581, 7250, 8619, 6573],
    'amount': [42331, 88420, 1714, 80572, 57549],
    'date': [1585425830, 1585425831, 1585425832, 1585425833, 1585425834]
})

In [56]:
data

   client_id  amount        date
0       5392   42331  1585425830
1       9581   88420  1585425831
2       7250    1714  1585425832
3       8619   80572  1585425833
4       6573   57549  1585425834

In [54]:
full_data = data.merge(df, on='client_id', how='inner')

Empty DataFrame
Columns: [client_id, amount, date, sex, wealth, age]
Index: []

In [59]:
idf = pd.read_csv('https://stepik.org/media/attachments/lesson/359209/companies.csv', sep=';')

In [67]:
idf.company.nunique()

289

In [69]:
idf.groupby('company') \
    .agg({'income': 'mean'})

                                                income
company
En +                                      9.962187e+10
АО «Александрова, Савельев и Мельникова»  7.206782e+10
АО «Андреев-Анисимов»                     6.931948e+09
АО «Андреев-Макарова»                     8.934380e+10
АО «Большаков Кошелева»                   7.860861e+10
...                                                ...
Щекиноазот                                4.309092e+10
Щукин Лимитед                             6.703036e+10
Эйвон Бьюти Продактс Компани (Avon)       2.503657e+10
Яковлева Инкорпорэйтед                    3.523436e+10
Якушев Лимитед                            3.876468e+10

[289 rows x 1 columns]

In [78]:
def read_n_agg(path):
    idf = pd.read_csv(path, sep=';')
    return idf.groupby('company', as_index=True) \
              .agg({'income': 'mean'})
filepath = 'https://stepik.org/media/attachments/lesson/359209/companies.csv'
read_n_agg(filepath)

                                                income
company
En +                                      9.962187e+10
АО «Александрова, Савельев и Мельникова»  7.206782e+10
АО «Андреев-Анисимов»                     6.931948e+09
АО «Андреев-Макарова»                     8.934380e+10
АО «Большаков Кошелева»                   7.860861e+10
...                                                ...
Щекиноазот                                4.309092e+10
Щукин Лимитед                             6.703036e+10
Эйвон Бьюти Продактс Компани (Avon)       2.503657e+10
Яковлева Инкорпорэйтед                    3.523436e+10
Якушев Лимитед                            3.876468e+10

[289 rows x 1 columns]